DELETE FROM user_roles;
DELETE FROM meals;
DELETE FROM users;
ALTER SEQUENCE global_seq RESTART WITH 100000;

INSERT INTO users (name, email, password) VALUES
  ('User', 'user@yandex.ru', 'password'),
  ('Admin', 'admin@gmail.com', 'admin');

INSERT INTO user_roles (role, user_id) VALUES
  ('ROLE_USER', 100000),
  ('ROLE_ADMIN', 100001);

INSERT INTO meals (date_time, description, calories, user_id) VALUES
  ('2018-10-21 7:00 ', 'Завтрак', 800, 100000),
  ('2018-10-21 13:00 ', 'Обед', 800, 100000),
  ('2018-10-21 20:00 ', 'Ужиг', 800, 100000),
  ('2018-10-22 7:00 ', 'Завтрак', 700, 100000),
  ('2018-10-22 13:00 ', 'Обед', 600, 100000),
  ('2018-10-22 20:00 ', 'Ужиг', 500, 100000),
  ('2018-10-23 7:00 ', 'Завтрак', 1000, 100001),
  ('2018-10-23 13:00 ', 'Обед', 500, 100001),
  ('2018-10-23 20:00 ', 'Ужиг', 500, 100001),
  ('2018-10-24 7:00 ', 'Завтрак', 1000, 100001),
  ('2018-10-24 13:00 ', 'Обед', 500, 100001),
  ('2018-10-24 20:00 ', 'Ужиг', 510, 100001),
  ('2018-10-25 7:00 ', 'Завтрак', 800, 100001),
  ('2018-10-25 13:00 ', 'Обед', 700, 100001),
  ('2018-10-25 20:00 ', 'Ужиг', 490, 100001);
